{
  "users": [
    {
      "profile": {
        "name": "Sam",
        "dietary_restrictions": "none, but i don't like seafood",
        "food_preferences": "middle eastern, asian, pizza, bagels, unique food, rooftop restaurants when the weather is good.",
        "drink_preferences": "craft beer, experimental cocktails, rooftop bars, speakeasies",
        "general_preferences": "museums, hiking, abandoned places, cool photography locations, aerospace museums, games, unique activities, astronomy, interesting parks"
      },
      "saved_locs": [
        "ChIJUemZBRRawokRXSg4Yn-fyvE",
        "ChIJEWHdJhRawokRoMR-DurUSl4",
        "ChIJIRiJaRRawokR2KyQ984qa-o",
        "ChIJ_8dmJ0lbwokRIJHQFfXiMNo",
        "ChIJ2zW7aDlbwokRy--jgJ8aXoc",
        "ChIJeSPdKCtbwokR7x28WMG2UN0"
      ],
      "id": 1
    },
    {
      "profile": {
        "name": "Lily (fake profile)",
        "dietary_restrictions": "Gluten-free and pescatarian",
        "food_preferences": "Prefers seafood dishes like shrimp scampi, grilled salmon, and crab cakes. Loves fresh fruits, especially berries, and vegetables like bell peppers and spinach. Enjoys salads with vinaigrette dressing.",
        "drink_preferences": "Green tea, sparkling water, and pomegranate juice. Occasionally enjoys white wine with seafood dishes.",
        "general_preferences": "Avid fan of baseball, enjoys playing the guitar, and loves attending live music concerts."
      },
      "saved_locs": [],
      "id": 2
    },
    {
      "profile": {
        "name": "Jake (fake profile)",
        "dietary_restrictions": "Lactose-intolerant",
        "food_preferences": "Prefers plant-based meals with tofu, tempeh, and seitan. Enjoys a variety of international cuisines, particularly Thai and Indian. Fond of spicy dishes, roasted vegetables, and grain bowls.",
        "drink_preferences": "Almond milk lattes, herbal teas, and coconut water. Enjoys craft beers with spicy food.",
        "general_preferences": "Enjoys rock climbing, mountain biking, and playing ultimate frisbee. Likes attending food festivals and trying new vegan eateries."
      },
      "saved_locs": [
        "ChIJWVSkhxdawokRNY0XSfQZN3M"
      ],
      "id": 3
    }
  ]
}